//На вход программе подаются координаты вершин треугольника ABC (сначала координаты вершины A, затем B, затем C).

//Выведите координаты пересечения биссектрисы ∠ACB со стороной AB, затем координаты точки пересечения биссектрисы ∠BAC со стороной BC, затем координаты точки пересечения биссектрисы ∠ABC со стороной AC. Все координаты выводите с точностью до 5 знаков после запятой.

#include <math.h>
#include <stdlib.h>
#include <stdio.h>

int main(void) {
    float x1, y1, x2, y2, x3, y3;
    scanf("%f %f", &x1, &y1);
    scanf("%f %f", &x2, &y2);
    scanf("%f %f", &x3, &y3);
    float p1, p2;
    p1 = sqrt((x3 - x2) * (x3 - x2) + (y3 - y2) * (y3 - y2));
    p2 = sqrt((x3 - x1) * (x3 - x1) + (y3 - y1) * (y3 - y1));
    float l = p1 / p2;
    printf("%.5f %.5f\n", (x2 + l * x1) / (1 + l), (y2 + l * y1) / (1 + l));
    float r1, r2;
    r1 = sqrt((x1 - x2) * (x1 - x2) + (y1 - y2) * (y1 - y2));
    r2 = sqrt((x1 - x3) * (x1 - x3) + (y1 - y3) * (y1 - y3));
    float l1 = r1 / r2;
    printf("%.5f %.5f\n", (x2 + l1 * x3) / (1 + l1), (y2 + l1 * y3) / (1 + l1));
    float s1, s2;
    s1 = sqrt((x2 - x1) * (x2 - x1) + (y2 - y1) * (y2 - y1));
    s2 = sqrt((x2 - x3) * (x2 - x3) + (y2 - y3) * (y2 - y3));
    float l2 = s1 / s2;
    printf("%.5f %.5f\n", (x1 + l2 * x3) / (1 + l2), (y1 + l2 * y3) / (1 + l2));
    return 0;
}9

